stm32duino/Arduino_Core_STM32/boards.txt
GenF4.menu.upload_method.hidMethod=HID Bootloader 2.2
GenF4.menu.upload_method.hidMethod.upload.protocol=hid22
GenF4.menu.upload_method.hidMethod.upload.tool=hid_upload
GenF4.menu.upload_method.hidMethod.build.flash_offset=0x4000
GenF4.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID -DVECT_TAB_OFFSET={build.flash_offset}                                                                                                        

###############################
# Sparky Flight Controllers

Sparky.name=Sparky flight controllers

Sparky.build.vid=0x0483
Sparky.build.core=arduino
Sparky.build.board=Sparky
Sparky.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# Sparky_V1 board
Sparky.menu.pnum.Sparky_V1=Sparky V1
Sparky.menu.pnum.Sparky_V1.upload.maximum_size=262144
Sparky.menu.pnum.Sparky_V1.upload.maximum_data_size=40960
Sparky.menu.pnum.Sparky_V1.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
Sparky.menu.pnum.Sparky_V1.build.board=Sparky_V1
Sparky.menu.pnum.Sparky_V1.build.series=STM32F3xx
Sparky.menu.pnum.Sparky_V1.build.product_line=STM32F303xC
Sparky.menu.pnum.Sparky_V1.build.variant=SPARKY_F303CC
Sparky.menu.pnum.Sparky_V1.build.cmsis_lib_gcc=arm_cortexM4l_math

# Upload menu
Sparky.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Sparky.menu.upload_method.swdMethod.upload.protocol=0
Sparky.menu.upload_method.swdMethod.upload.options=-g
Sparky.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Sparky.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Sparky.menu.upload_method.serialMethod.upload.protocol=1
Sparky.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
Sparky.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Sparky.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Sparky.menu.upload_method.dfuMethod.upload.protocol=2
Sparky.menu.upload_method.dfuMethod.upload.options=-g
Sparky.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# RAK boards

RAK.name=RAKWireless

RAK.build.vid=0x0483
RAK.build.core=arduino
RAK.build.board=RAK
RAK.build.mcu=cortex-m3
RAK.build.series=STM32L1xx
RAK.build.cmsis_lib_gcc=arm_cortexM3l_math
RAK.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# RAK811_TRACKER board
RAK.menu.pnum.RAK811_TRACKER=RAK811 LoRa Tracker (16kb RAM)
RAK.menu.pnum.RAK811_TRACKER.upload.maximum_data_size=16384
RAK.menu.pnum.RAK811_TRACKER.upload.maximum_size=131072
RAK.menu.pnum.RAK811_TRACKER.build.board=RAK811_TRACKER
RAK.menu.pnum.RAK811_TRACKER.build.product_line=STM32L151xB
RAK.menu.pnum.RAK811_TRACKER.build.variant=RAK811_TRACKER

RAK.menu.pnum.RAK811_TRACKERA=RAK811 LoRa Tracker (32kb RAM)
RAK.menu.pnum.RAK811_TRACKERA.upload.maximum_data_size=32768
RAK.menu.pnum.RAK811_TRACKERA.upload.maximum_size=131072
RAK.menu.pnum.RAK811_TRACKERA.build.board=RAK811_TRACKERA
RAK.menu.pnum.RAK811_TRACKERA.build.product_line=STM32L151xBA
RAK.menu.pnum.RAK811_TRACKERA.build.variant=RAK811_TRACKER

# Upload menu
RAK.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
RAK.menu.upload_method.swdMethod.upload.protocol=0
RAK.menu.upload_method.swdMethod.upload.options=-g
RAK.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

RAK.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
RAK.menu.upload_method.serialMethod.upload.protocol=1
RAK.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
RAK.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

RAK.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
RAK.menu.upload_method.dfuMethod.upload.protocol=2
RAK.menu.upload_method.dfuMethod.upload.options=-g
RAK.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

###############################
# 3D printer boards

3dprinter.name=3D printer boards

3dprinter.build.vid=0x0483
3dprinter.build.core=arduino
3dprinter.build.board=3dprinter
3dprinter.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# ARMED_V1 board
3dprinter.menu.pnum.ARMED_V1=Armed V1
3dprinter.menu.pnum.ARMED_V1.upload.maximum_size=1048576
3dprinter.menu.pnum.ARMED_V1.upload.maximum_data_size=196608
3dprinter.menu.pnum.ARMED_V1.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
3dprinter.menu.pnum.ARMED_V1.build.board=ARMED_V1
3dprinter.menu.pnum.ARMED_V1.build.series=STM32F4xx
3dprinter.menu.pnum.ARMED_V1.build.product_line=STM32F407xx
3dprinter.menu.pnum.ARMED_V1.build.variant=ARMED_V1
3dprinter.menu.pnum.ARMED_V1.build.cmsis_lib_gcc=arm_cortexM4l_math
3dprinter.menu.pnum.ARMED_V1.build.vid=0x0483
3dprinter.menu.pnum.ARMED_V1.build.pid=0x5740

# REMRAM_V1 board
3dprinter.menu.pnum.REMRAM_V1=RemRam v1
3dprinter.menu.pnum.REMRAM_V1.upload.maximum_size=2097152
3dprinter.menu.pnum.REMRAM_V1.upload.maximum_data_size=524288
3dprinter.menu.pnum.REMRAM_V1.build.mcu=cortex-m7 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
3dprinter.menu.pnum.REMRAM_V1.build.board=REMRAM_V1
3dprinter.menu.pnum.REMRAM_V1.build.series=STM32F7xx
3dprinter.menu.pnum.REMRAM_V1.build.product_line=STM32F765xx
3dprinter.menu.pnum.REMRAM_V1.build.variant=REMRAM_V1
3dprinter.menu.pnum.REMRAM_V1.build.cmsis_lib_gcc=arm_cortexM7l_math

# RUMBA32 board
3dprinter.menu.pnum.RUMBA32=RUMBA32
3dprinter.menu.pnum.RUMBA32.upload.maximum_size=524288
3dprinter.menu.pnum.RUMBA32.upload.maximum_data_size=131072
3dprinter.menu.pnum.RUMBA32.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
3dprinter.menu.pnum.RUMBA32.build.board=RUMBA32_F446VE
3dprinter.menu.pnum.RUMBA32.build.series=STM32F4xx
3dprinter.menu.pnum.RUMBA32.build.product_line=STM32F446xx
3dprinter.menu.pnum.RUMBA32.build.variant=RUMBA32_F446VE
3dprinter.menu.pnum.RUMBA32.build.cmsis_lib_gcc=arm_cortexM4l_math

# STEVAL-3DP001V1 board
3dprinter.menu.pnum.ST3DP001_EVAL=STEVAL-3DP001V1
3dprinter.menu.pnum.ST3DP001_EVAL.upload.maximum_size=524288
3dprinter.menu.pnum.ST3DP001_EVAL.upload.maximum_data_size=98304
3dprinter.menu.pnum.ST3DP001_EVAL.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
3dprinter.menu.pnum.ST3DP001_EVAL.build.board=ST3DP001_EVAL
3dprinter.menu.pnum.ST3DP001_EVAL.build.series=STM32F4xx
3dprinter.menu.pnum.ST3DP001_EVAL.build.product_line=STM32F401xE
3dprinter.menu.pnum.ST3DP001_EVAL.build.variant=ST3DP001_EVAL
3dprinter.menu.pnum.ST3DP001_EVAL.build.cmsis_lib_gcc=arm_cortexM4l_math

# PRNTR_F407_V1 board
3dprinter.menu.pnum.PRNTR_F407_V1=PRNTR F407 v1
3dprinter.menu.pnum.PRNTR_F407_V1.upload.maximum_size=524288
3dprinter.menu.pnum.PRNTR_F407_V1.upload.maximum_data_size=196608
3dprinter.menu.pnum.PRNTR_F407_V1.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
3dprinter.menu.pnum.PRNTR_F407_V1.build.board=PRNTR_F407_V1
3dprinter.menu.pnum.PRNTR_F407_V1.build.series=STM32F4xx
3dprinter.menu.pnum.PRNTR_F407_V1.build.product_line=STM32F407xx
3dprinter.menu.pnum.PRNTR_F407_V1.build.variant=PRNTR_F407_V1
3dprinter.menu.pnum.PRNTR_F407_V1.build.cmsis_lib_gcc=arm_cortexM4l_math

# EEXTR_F030_V1 board
3dprinter.menu.pnum.EEXTR_F030_V1=EExtruder F030 V1
3dprinter.menu.pnum.EEXTR_F030_V1.upload.maximum_size=65536
3dprinter.menu.pnum.EEXTR_F030_V1.upload.maximum_data_size=8192
3dprinter.menu.pnum.EEXTR_F030_V1.build.mcu=cortex-m0
3dprinter.menu.pnum.EEXTR_F030_V1.build.board=EEXTR_F030_V1
3dprinter.menu.pnum.EEXTR_F030_V1.build.series=STM32F0xx
3dprinter.menu.pnum.EEXTR_F030_V1.build.product_line=STM32F030x8
3dprinter.menu.pnum.EEXTR_F030_V1.build.variant=EEXTR_F030_V1
3dprinter.menu.pnum.EEXTR_F030_V1.build.cmsis_lib_gcc=arm_cortexM0l_math

